src/cf/Enums/пбп_ТипыОтветовREST.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>пбп_ТипыОтветовREST</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Успешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаНеКорректныйЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаНеАвторизован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаНетДоступа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаНеНайдено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаМетодНеПоддерживается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаСпецификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругаяКлиентскаяОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОПеренаправлении</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/пбп_ПостроительСпецификацииOpenAPI/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL: https://github.com/firstBitSportivnaya/PSSL/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция предназначена для обработки входящих запросов формирования спецификации.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос - Запрос формирования спецификации.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с ошибкой или данными спецификации.
//
Функция ОбработатьЗапросСпецификации(Запрос) Экспорт
	
	Перем РезультатОбработчика;
	
	Параметры = ПараметрыОбработчика(Запрос);
	
	Попытка
		Обработчик = ПеренаправлениеНаОбработчик(Запрос.ОтносительныйURL, Параметры);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		
		Возврат СформироватьОтветОшибки(ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Обработчик) Тогда
		Попытка
			РезультатОбработчика = пбп_Переадресация.ВычислитьВБезопасномРежиме(Обработчик, Параметры);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			
			Возврат СформироватьОтветОшибки(ОписаниеОшибки);
		КонецПопытки;
		
		КонтекстОтвета = СформироватьДанныеКонтекстаОтвета(РезультатОбработчика);
	Иначе
		ОписаниеОшибки = пбп_ПереадресацияКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Ресурс %1 не найден'"),
			Запрос.ОтносительныйURL);
		
		Возврат СформироватьОтветОшибки(ОписаниеОшибки);
	КонецЕсли;
		
	Возврат СформироватьОтвет(КонтекстОтвета);
	
КонецФункции

// Возвращает обработчик для передаваемого ресурса.
//
// Параметры:
//  Ресурс	 - Строка - Ресурс сервиса. 
// 
// Возвращаемое значение:
//  Строка - Обработчик ресурса
//
Функция ПолучитьОбработчикРесурса(Ресурс) Экспорт
	
	Обработчик = пбп_ПостроительСпецификацииOpenAPIПовтИсп.ОбработчикиРесурсов()[Ресурс];
	
	Если Обработчик = Неопределено Тогда
		ВызватьИсключение пбп_ПереадресацияКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не найден обработчик для ресурса %1'"),
			Ресурс);
	КонецЕсли;
	
	Возврат Обработчик;
	
КонецФункции

// Возвращает спецификация по имени сервиса.
//
// Параметры:
//  ИмяСервиса	 - Строка - Имя сервиса, по которому запрошена спецификация.
// 
// Возвращаемое значение:
//  Строка - Содержит текст спецификации.
//
Функция ПолучитьСпецификациюСервиса(ИмяСервиса) Экспорт 
	
	ИмяСпецификации = пбп_ПостроительСпецификацииOpenAPIПереопределяемый.ИменаМакетовСервисов()[ИмяСервиса];
	
	Если ИмяСпецификации = Неопределено Тогда
		ВызватьИсключение пбп_ПереадресацияКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не найдена спецификация сервиса %1'"),
			ИмяСервиса);
	КонецЕсли;
	
	Возврат ПолучитьОбщийМакет(ИмяСпецификации).ПолучитьТекст();
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

Функция ПеренаправлениеНаОбработчик(Ресурс, Параметры) Экспорт
	
	Обработчик = ПолучитьОбработчикРесурса(Ресурс);
	
	ПередаваемыеПараметры = ?(ЗначениеЗаполнено(Параметры), "Параметры", "");
	
	Выражение = Обработчик + "(" + ПередаваемыеПараметры + ")";
	
	Возврат Выражение;

КонецФункции

Функция ОбработчикМетодаДокументацииСервиса(Параметры) Экспорт
	
	КорневойURL = Параметры.КорневойURL;
	
	Иконка16Ссылка = КорневойURL + "/favicon-16x16.png";
	Иконка32Ссылка = КорневойURL + "/favicon-32x32.png";
	СтилиСсылка = КорневойURL + "/swagger-ui.css";
	СкриптыСсылка = КорневойURL + "/swagger-ui-bundle.js";
	СпецификацияСсылка = КорневойURL + "/openapi.json";
	
	ТипОтвета = Перечисления.пбп_ТипыОтветовREST.Успешно;
	
	Макет = ПолучитьОбщийМакет("СпецификацияСтраницаREST");
	Макет.ВставитьСтроку(15, "supportedSubmitMethods: [], // Отключает кнопку ""Try it out""");
	
	СодержаниеОтвета = Макет.ПолучитьТекст();
	СодержаниеОтвета = СтрЗаменить(СодержаниеОтвета, "[Заголовок]", "Swagger UI");
	СодержаниеОтвета = СтрЗаменить(СодержаниеОтвета, "[Иконка16Ссылка]", Иконка16Ссылка);
	СодержаниеОтвета = СтрЗаменить(СодержаниеОтвета, "[Иконка32Ссылка]", Иконка32Ссылка);
	СодержаниеОтвета = СтрЗаменить(СодержаниеОтвета, "[СтилиСсылка]", СтилиСсылка);
	СодержаниеОтвета = СтрЗаменить(СодержаниеОтвета, "[СкриптыСсылка]", СкриптыСсылка);
	СодержаниеОтвета = СтрЗаменить(СодержаниеОтвета, "[СпецификацияСсылка]", СпецификацияСсылка);
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "text/html; charset=utf-8");
	
	Возврат СформироватьРезультатОбработчика(ТипОтвета, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

Функция ОбработчикМетодаИконка16ДокументацииСервиса() Экспорт
	
	ТипОтвета = Перечисления.пбп_ТипыОтветовREST.Успешно;
	
	СодержаниеОтвета = ПолучитьОбщийМакет("СпецификацияИконка16СтраницыREST");
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "image/png");
	
	Возврат СформироватьРезультатОбработчика(ТипОтвета, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

Функция ОбработчикМетодаИконка32ДокументацииСервиса() Экспорт
	
	ТипОтвета = Перечисления.пбп_ТипыОтветовREST.Успешно;
	
	СодержаниеОтвета = ПолучитьОбщийМакет("СпецификацияИконка32СтраницыREST");
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "image/png");
	
	Возврат СформироватьРезультатОбработчика(ТипОтвета, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

Функция ОбработчикМетодаСтилейДокументацииСервиса() Экспорт
	
	ТипОтвета = Перечисления.пбп_ТипыОтветовREST.Успешно;
	
	СодержаниеОтвета = ПолучитьОбщийМакет("СпецификацияСтилиСтраницыREST").ПолучитьТекст();
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "text/css; charset=utf-8");
	
	Возврат СформироватьРезультатОбработчика(ТипОтвета, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

Функция ОбработчикМетодаСкриптовДокументацииСервиса() Экспорт
	
	ТипОтвета = Перечисления.пбп_ТипыОтветовREST.Успешно;
	
	СодержаниеОтвета = ПолучитьОбщийМакет("СпецификацияСкриптыСтраницыREST").ПолучитьТекст();
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "application/javascript; charset=utf-8");
	
	Возврат СформироватьРезультатОбработчика(ТипОтвета, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

Функция ОбработчикМетодаСпецификацииСервиса(Параметры) Экспорт
	
	ТипОтвета = Перечисления.пбп_ТипыОтветовREST.Успешно;
	
	СодержаниеОтвета = ПолучитьСпецификациюСервиса(Параметры.ИмяСервиса);
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "application/json");
	
	Возврат СформироватьРезультатОбработчика(ТипОтвета, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

Функция ОбработчикМетодаСостоянияСервиса() Экспорт
	
	ТипОтвета = Перечисления.пбп_ТипыОтветовREST.Успешно;
	
	СодержаниеОтвета = Новый Структура;
	СодержаниеОтвета.Вставить("status", "pass");
	
	ЗаголовкиОтвета = Новый Соответствие;
	ЗаголовкиОтвета.Вставить("Content-Type", "application/json");
	
	Возврат СформироватьРезультатОбработчика(ТипОтвета, СодержаниеОтвета, ЗаголовкиОтвета);
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция СформироватьОтветОшибки(ОписаниеОшибки)
	
	ТипОтвета = Перечисления.пбп_ТипыОтветовREST.ОшибкаНеНайдено;
	
	РезультатОбработчика = СформироватьРезультатОбработчика(ТипОтвета, ОписаниеОшибки);
	
	КонтекстОтвета = СформироватьДанныеКонтекстаОтвета(РезультатОбработчика);
	
	Возврат СформироватьОтвет(КонтекстОтвета);
	
КонецФункции

Функция СформироватьОтвет(КонтекстОтвета)
	
	Результат = Новый HTTPСервисОтвет(КонтекстОтвета.Код);
	
	Если ЗначениеЗаполнено(КонтекстОтвета.ТелоСтрока) Тогда
		Результат.УстановитьТелоИзСтроки(КонтекстОтвета.ТелоСтрока);
	ИначеЕсли ЗначениеЗаполнено(КонтекстОтвета.ТелоДвоичныеДанные) Тогда
		Результат.УстановитьТелоИзДвоичныхДанных(КонтекстОтвета.ТелоДвоичныеДанные);
	КонецЕсли;
	
	Для Каждого КЗ Из КонтекстОтвета.Заголовки Цикл
		Результат.Заголовки.Вставить(КЗ.Ключ, КЗ.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураДанныхКонтекстаОтвета()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Код", 200);
	Результат.Вставить("ТелоСтрока", Неопределено);
	Результат.Вставить("ТелоДвоичныеДанные", Неопределено);
	Результат.Вставить("Заголовки", Новый Соответствие);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьДанныеКонтекстаОтвета(РезультатОбработчика)
	
	ТипОтвета = РезультатОбработчика.ТипОтвета;
	СодержаниеОтвета = РезультатОбработчика.СодержаниеОтвета;
	ЗаголовкиОтвета = РезультатОбработчика.ЗаголовкиОтвета;
	
	Результат = СтруктураДанныхКонтекстаОтвета();
	
	Если ТипОтвета = Перечисления.пбп_ТипыОтветовREST.Успешно Тогда
		Если ТипЗнч(СодержаниеОтвета) = Тип("ДвоичныеДанные") Тогда
			Результат.ТелоДвоичныеДанные = СодержаниеОтвета;
		Иначе
			Результат.ТелоСтрока = СодержаниеОтвета;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаголовкиОтвета) Тогда
			Для Каждого КЗ Из ЗаголовкиОтвета Цикл
				Результат.Заголовки.Вставить(КЗ.Ключ, КЗ.Значение);
			КонецЦикла;
		КонецЕсли;
	Иначе
		СлужебныеТипыОтветов = Перечисления.пбп_ТипыОтветовREST.ПолучитьСлужебныеВидыОтветов();
		КодОтвета = СлужебныеТипыОтветов.Получить(ТипОтвета);
		
		ОписаниеОшибки = СтруктураДанныхОписаниеОшибки();
		ОписаниеОшибки.detail = СодержаниеОтвета;
		
		Результат.Код = КодОтвета;
		Результат.ТелоСтрока = ЗаписатьОбъектВJSON(ОписаниеОшибки);
		Результат.Заголовки.Вставить("Content-Type", "application/json");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьОбъектВJSON(Объект)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Объект);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция СтруктураДанныхОписаниеОшибки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("detail");
	
	Возврат Результат;
	
КонецФункции

Функция БазовыйРесурс()
	Возврат "/openapi";
КонецФункции

Функция РесурсСпецификацииСервиса()
	Возврат "/openapi.json";
КонецФункции

Функция ПараметрыОбработчика(Запрос)
	
	Параметры = Новый Структура;
	
	ИмяСервиса = ПолучитьКлючСервиса(Запрос);
	
	Если Запрос.ОтносительныйURL = БазовыйРесурс() Тогда
		Параметры.Вставить("КорневойURL", Запрос.БазовыйURL);
	ИначеЕсли Запрос.ОтносительныйURL = РесурсСпецификацииСервиса() Тогда
		Параметры.Вставить("ИмяСервиса", ИмяСервиса);
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьКлючСервиса(Запрос)
	
	Адрес = Запрос.БазовыйURL;
	Позиция = СтрНайти(Адрес, "/", НаправлениеПоиска.СКонца);
	
	Результат = Сред(Адрес, Позиция + 1);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьРезультатОбработчика(ТипОтвета, СодержаниеОтвета = Неопределено, ЗаголовкиОтвета = Неопределено)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТипОтвета", ТипОтвета);
	Результат.Вставить("СодержаниеОтвета", СодержаниеОтвета);
	Результат.Вставить("ЗаголовкиОтвета", ЗаголовкиОтвета);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
